{
	"EOObjectNotAvailableException" = "This object was not found in the database. It was probably deleted by someone else.";
	"IllegalCharacterInNumberException" = "Please check the value <b>@@value@@</b> you supplied for the field <b>@@displayNameForProperty@@</b>.";
	"InvalidDateFormatException" = "Please check <b>@@displayNameForProperty@@</b> as <b>@@value@@</b> is not a valid date";
	"InvalidNumberException" = "The value is an invalid number.";
	"MandatoryToManyRelationshipException" = "A <b>@@displayNameForEntity@@</b> must have a least one <b>@@displayNameForDestinationEntity@@</b>.";
	"MandatoryToOneRelationshipException" = "A <b>@@displayNameForEntity@@</b> must have a <b>@@displayNameForProperty@@</b>.";
	"NotANumberException" = "Sorry, I could not read this number <b>@@value@@</b> ";
	"NullPropertyException" = "Please provide a <b>@@displayNameForProperty@@</b>.";
	"ObjectCannotBeDeletedException" = "Cannot delete this <b>@@displayNameForEntity@@</b> because either this <b>@@displayNameForEntity@@</b> or any object related to this <b>@@displayNameForEntity@@</b> cannot be deleted.";
	"ObjectRemovalException" = "Cannot delete this <b>@@displayNameForEntity@@</b>. You should first delete the item in its <b>@@displayNameForProperty@@</b>.";
	"ObjectsRemovalException" = "Cannot delete this <b>@@displayNameForEntity@@</b>. You should first delete the items in its <b>@@displayNameForProperty@@</b>.";
	"PasswordsDontMatchException" = "The <b>@@displayNameForProperty@@</b> values you entered don't match";
	"PasswordsFillBothFieldsException" = "Please fill in both <b>@@displayNameForProperty@@</b> fields";
	"UnacceptableMimeTypeException" = "The file type selected is the incorrect type for @@displayNameForProperty@@.";
	"UnsupportedMimeTypeException" = "The file type selected for @@displayNameForProperty@@ is unknown.";
	"UploadFailedException" = "The file for @@displayNameForProperty@@ failed to upload.";
}
